package KR;

/*
Напишите обобщенный метод compareArrays(),
который принимает два массива и возвращает true,
если они одинаковые, и false в противном случае.
Массивы могут быть любого типа данных,
но должны иметь одинаковую длину и содержать элементы одного типа по парно по индексам.
То есть тип элемента в первом массиве под нулевым индексом такой же как тип элемента
во втором массиве под нулевым индексом (и под всеми остальными индексами аналогично)
 */


public class Main {

    public static void main(String[] args) {
        Menu.start();
    }
}